tangyangguang/Esp32Base/src/web/internal/WebTools.cpp
#include "../../Esp32BaseProfile.h"

#if ESP32BASE_ENABLE_WEB

#include "WebInternal.h"

namespace esp32base_web {

#if ESP32BASE_ENABLE_FILELOG
void sendFileLogModeOption(const char* value, const char* label, Esp32BaseFileLog::Mode mode) {
    sendChunk("<label><input type='radio' name='mode' value='");
    sendEscapedHtmlChunk(value);
    sendChunk("'");
    if (Esp32BaseFileLog::mode() == mode) {
        sendChunk(" checked");
    }
    sendChunk("> ");
    sendEscapedHtmlChunk(label);
    sendChunk("</label> ");
}

bool fileLogModeFromArg(const String& raw, Esp32BaseFileLog::Mode& mode) {
    if (raw == "off") {
        mode = Esp32BaseFileLog::OFF;
        return true;
    }
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_ERROR
    if (raw == "error") {
        mode = Esp32BaseFileLog::ERROR;
        return true;
    }
#endif
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_WARN
    if (raw == "warn") {
        mode = Esp32BaseFileLog::WARN;
        return true;
    }
#endif
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_INFO
    if (raw == "info") {
        mode = Esp32BaseFileLog::INFO;
        return true;
    }
#endif
    return false;
}

const char* fileLogModeName(Esp32BaseFileLog::Mode mode) {
    switch (mode) {
        case Esp32BaseFileLog::ERROR: return "ERROR";
        case Esp32BaseFileLog::WARN: return "WARN";
        case Esp32BaseFileLog::INFO: return "INFO";
        case Esp32BaseFileLog::OFF:
        default: return "OFF";
    }
}

const char* fileLogRuntimeStateName() {
    if (Esp32BaseFileLog::faulted()) {
        return "write fault";
    }
    if (Esp32BaseFileLog::isEnabled()) {
        return "enabled";
    }
    return Esp32BaseFileLog::mode() == Esp32BaseFileLog::OFF ? "disabled" : "unavailable";
}

Esp32BaseWeb::UiTone fileLogRuntimeStateTone() {
    return Esp32BaseFileLog::faulted() ? Esp32BaseWeb::UI_WARN :
           (Esp32BaseFileLog::isEnabled() ? Esp32BaseWeb::UI_OK :
            (Esp32BaseFileLog::mode() == Esp32BaseFileLog::OFF ? Esp32BaseWeb::UI_INFO : Esp32BaseWeb::UI_WARN));
}

bool fileLogHasRuntimeDetails() {
    return Esp32BaseFileLog::faulted() || Esp32BaseFileLog::isEnabled() || Esp32BaseFileLog::mode() != Esp32BaseFileLog::OFF;
}

void sendFileLogRuntimeStateTag() {
    sendStatusTag(fileLogRuntimeStateTone(), fileLogRuntimeStateName());
}

void sendFileLogRuntimeStateRow(const char* label) {
    sendInfoRowStart(label);
    sendFileLogRuntimeStateTag();
    sendInfoRowEnd();
}

void sendFileLogRuntimeNotice() {
    if (Esp32BaseFileLog::faulted()) {
        sendChunk("<p class='notice warn'>New system log writes are stopped after a FS write failure. Existing system diagnostic logs may still be readable. Clear space or save the system log mode again after maintenance.</p>");
    } else if (!Esp32BaseFileLog::isEnabled() && Esp32BaseFileLog::mode() != Esp32BaseFileLog::OFF) {
        sendChunk("<p class='notice warn'>System logs are unavailable because FileLog could not initialize with the current filesystem state. Check LittleFS, format if needed, or save the system log mode again after maintenance.</p>");
    } else if (Esp32BaseFileLog::mode() == Esp32BaseFileLog::OFF) {
        sendChunk("<p class='notice info'>System log mode is OFF. Existing system diagnostic logs are historical; new logs are not written.</p>");
    }
}
#endif

void sendFooterBarModeOption(const char* value, const char* label, Esp32BaseWeb::FooterBarMode mode) {
    sendChunk("<label><input type='radio' name='mode' value='");
    sendEscapedHtmlChunk(value);
    sendChunk("'");
    if (Esp32BaseWeb::footerBarMode() == mode) {
        sendChunk(" checked");
    }
    sendChunk("> ");
    sendEscapedHtmlChunk(label);
    sendChunk("</label> ");
}

bool footerBarModeFromArg(const String& raw, Esp32BaseWeb::FooterBarMode& mode) {
    if (raw == "off") {
        mode = Esp32BaseWeb::FOOTER_BAR_OFF;
        return true;
    }
    if (raw == "status") {
        mode = Esp32BaseWeb::FOOTER_BAR_STATUS_ONLY;
        return true;
    }
    if (raw == "full") {
        mode = Esp32BaseWeb::FOOTER_BAR_FULL;
        return true;
    }
    return false;
}

#if ESP32BASE_ENABLE_WATCHDOG
void sendWatchdogPanel() {
    const WatchdogTripState state = readWatchdogTripState();
    char count[32];
    char resetAt[32];
    formatWatchdogTripResetAt(state, resetAt, sizeof(resetAt));
    snprintf(count, sizeof(count), "%lu",
             static_cast<unsigned long>(state.lifetime));
    sendChunk("<section class='panel actionpanel'><h2>Watchdog trip</h2><div class='tablewrap'><table class='kv'>");
    sendInfoRow("Lifetime resets", count);
    if (state.invalidBase) {
        sendInfoRow("Trip resets", "invalid baseline");
    } else {
        snprintf(count, sizeof(count), "%lu",
                 static_cast<unsigned long>(state.trip));
        sendInfoRow("Trip resets", count);
    }
    sendInfoRow("Trip reset at", resetAt);
    sendChunk("</table></div><form method='post' action='/esp32base/system/watchdog-trip-reset' onsubmit=\"return confirm('Reset Watchdog trip counter? Lifetime resets are kept.')&&once(this)\"><div class='actions'><input type='submit' value='Reset Watchdog Trip'></div></form></section>");
}
#endif

#if ESP32BASE_ENABLE_RECORD_STORE
Esp32BaseWeb::UiTone businessRecordStoreTone(Esp32BaseRecordStore::StoreState state) {
    return state == Esp32BaseRecordStore::StoreState::Ready ? Esp32BaseWeb::UI_OK :
           (state == Esp32BaseRecordStore::StoreState::Degraded ||
            state == Esp32BaseRecordStore::StoreState::WriteFault ? Esp32BaseWeb::UI_WARN :
            Esp32BaseWeb::UI_DANGER);
}

const char* businessRecordStoreDisplayName(const char* path) {
    if (!path || !path[0]) return "unknown";
    const char* slash = strrchr(path, '/');
    return slash && slash[1] ? slash + 1 : path;
}

void sendBusinessRecordStoresClearPanel() {
    const uint8_t count = businessRecordStoreCount();
    if (count == 0) return;
    bool allReady = true;
    sendChunk("<section class='panel dangerpanel'><h2>Clear Business Records</h2><p class='dangertext'>Logically clear every registered current-version business RecordStore. IDs continue increasing. App Events, system logs, settings, WiFi and historical unregistered versions are not changed.</p><div class='tablewrap'><table class='kv'>");
    for (uint8_t i = 0; i < count; ++i) {
        Esp32BaseRecordStore* store = businessRecordStoreAt(i);
        Esp32BaseRecordStore::StoreStatus status;
        const bool initialized = store && store->readStatus(status);
        const bool ready = initialized && status.ready;
        allReady = allReady && ready;
        sendInfoRowStart(initialized ? businessRecordStoreDisplayName(status.path) : "unknown");
        if (initialized) {
            sendStatusTag(businessRecordStoreTone(status.state), Esp32BaseRecordStore::storeStateName(status.state));
            sendChunk(" &middot; ");
            sendUintChunk(status.recordCount);
            sendChunk(" records");
            if (status.error != Esp32BaseRecordStore::StoreError::None) {
                sendChunk(" &middot; error ");
                sendEscapedHtmlChunk(status.errorReason ? status.errorReason : "unknown");
            }
        } else {
            sendStatusTag(Esp32BaseWeb::UI_DANGER, "not initialized");
        }
        sendInfoRowEnd();
    }
    sendChunk("</table></div>");
    if (allReady) {
        sendChunk("<form method='post' action='/esp32base/system/business-records-clear' onsubmit=\"return confirm('Clear all registered current-version business records? IDs will continue increasing.')&&once(this)\"><div class='actions'><input class='danger' type='submit' value='Clear Business Records'></div></form>");
    } else {
        sendChunk("<p class='notice warn'>No records will be cleared while any registered Store is unavailable or structurally invalid.</p><div class='actions'><input class='danger' type='submit' value='Clear Business Records' disabled></div>");
    }
    sendChunk("</section>");
}
#endif

void handleRestart() {
    markRequest();
    if (!ensurePostAllowed("restart")) {
        return;
    }
    g_server.send(200, "text/plain", "restarting");
    delay(100);
    Esp32BaseSystem::restart("web");
}

void handleToolsPage() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    Esp32BaseWeb::sendHeader(g_builtinLabels[Esp32BaseWeb::BUILTIN_TOOLS]);
    Esp32BaseWeb::sendPageTitle(g_builtinLabels[Esp32BaseWeb::BUILTIN_TOOLS], "Low-frequency device settings and maintenance actions.");
    if (g_server.hasArg("formatted")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "LittleFS formatted", "System stores and registered business RecordStores were recreated, and system log mode was reloaded.");
    } else if (g_server.hasArg("logs_cleared")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "System logs cleared");
#if ESP32BASE_ENABLE_RECORD_STORE
    } else if (g_server.hasArg("business_records_cleared")) {
        char message[96];
        snprintf(message, sizeof(message), "%lu current-version business Store(s) were logically cleared. IDs were preserved.",
                 static_cast<unsigned long>(strtoul(g_server.arg("business_records_cleared").c_str(), nullptr, 10)));
        Esp32BaseWeb::sendNotice(g_server.hasArg("cleanup_warning") ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK,
                                 g_server.hasArg("cleanup_warning") ? "Business records cleared with cleanup warnings" : "Business records cleared",
                                 message);
    } else if (g_server.hasArg("business_records_clear_failed")) {
        char message[112];
        snprintf(message, sizeof(message), "%lu of %lu Store(s) were cleared before a failure. Check Store status and system logs before retrying.",
                 static_cast<unsigned long>(strtoul(g_server.arg("cleared").c_str(), nullptr, 10)),
                 static_cast<unsigned long>(strtoul(g_server.arg("total").c_str(), nullptr, 10)));
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "Business records were only partially cleared", message);
    } else if (g_server.hasArg("business_records_not_ready")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "Business records were not cleared", "At least one registered Store was unavailable or structurally invalid. No Store was changed.");
#endif
#if ESP32BASE_ENABLE_APP_EVENTS
    } else if (g_server.hasArg("app_events_cleared")) {
#if ESP32BASE_ENABLE_APP_EVENT_CONDITIONS
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "App Event history cleared", "Confirmed condition states were preserved.");
#else
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "App Event history cleared");
#endif
#endif
    } else if (g_server.hasArg("filelog_saved")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "System log mode saved");
    } else if (g_server.hasArg("footer_saved")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Footer bar mode saved");
    } else if (g_server.hasArg("watchdog_trip_reset")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Watchdog trip reset");
    } else if (g_server.hasArg("error")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "System action failed", g_server.arg("error").c_str());
    } else if (g_server.hasArg("restarting")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Restart requested", "Device is restarting. Please wait a few seconds, then reload.");
    }
    if (g_server.hasArg("hostname_saved")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Hostname saved", "Restart the device for mDNS, OTA and Web discovery to use it.");
    } else if (g_server.hasArg("hostname_error")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "Hostname was not saved", g_server.arg("hostname_error").c_str());
    }
    sendChunk("<section class='panel actionpanel'><h2>System settings</h2><div class='toollinks'>");
#if ESP32BASE_ENABLE_APP_CONFIG
    Esp32BaseWeb::sendInfoRowCompactLink("App Config", "Application configuration values registered by the app.", nullptr, "/esp32base/app-config", "Open", Esp32BaseWeb::UI_INFO);
#endif
    Esp32BaseWeb::sendInfoRowCompactLink("WiFi Setup", "Stored credentials used by station mode and WiFi recovery.", nullptr, "/esp32base/wifi", "Open", Esp32BaseWeb::UI_INFO);
    Esp32BaseWeb::sendInfoRowCompactLink("Web Auth", "HTTP Basic Auth credentials for built-in routes.", nullptr, "/esp32base/auth", "Open", Esp32BaseWeb::UI_INFO);
#if ESP32BASE_ENABLE_OTA
    Esp32BaseWeb::sendInfoRowCompactLink("Firmware OTA", "Authenticated firmware upload endpoint.", nullptr, "/esp32base/ota", "Open", Esp32BaseWeb::UI_INFO);
#endif
#if ESP32BASE_ENABLE_FS
    Esp32BaseWeb::sendInfoRowCompactLink("File system", "Read-only LittleFS inventory and size summary.", nullptr, "/esp32base/fs", "Open", Esp32BaseWeb::UI_INFO);
#endif
    sendChunk("</div></section>");
    char storedHostname[64] = "";
    const bool hasStoredHostname = loadStoredHostname(storedHostname, sizeof(storedHostname));
    sendChunk("<div class='toolgrid'>");
    sendChunk("<section class='panel formpanel hostpanel'><h2>Hostname</h2><div class='hostfacts'><span><b>Current</b>");
    sendEscapedHtmlChunk(Esp32Base::hostname());
    sendChunk("</span><span><b>Default</b>");
    sendEscapedHtmlChunk(Esp32Base::defaultHostname());
    sendChunk("</span><span><b>Stored</b>");
    sendEscapedHtmlChunk(hasStoredHostname && storedHostname[0] ? storedHostname : "-");
    sendChunk("</span><span><b>Restart</b>");
    if (hostnameRestartRequired(storedHostname)) {
        sendChunk("<span class='tag warn'>required</span>");
    } else {
        sendChunk("no");
    }
    sendChunk("</span></div><form class='editform' method='post' action='/esp32base/system/hostname' onsubmit=\"var h=this.hostname.value.trim();if(!/^[a-z0-9](?:[a-z0-9-]{0,30}[a-z0-9])?$/.test(h)){alert('Use 1-32 lowercase letters, digits and hyphen. No leading or trailing hyphen. Do not include .local.');return false;}this.hostname.value=h;return once(this);\"><div class='hostedit'>");
    sendChunk("<div class='field'><label for='host'>New hostname</label><input id='host' name='hostname' maxlength='32' autocomplete='off' value='");
    sendEscapedHtmlChunk(hasStoredHostname && storedHostname[0] ? storedHostname : Esp32Base::hostname());
    sendChunk("'><small>Saved hostname takes effect after restart.</small></div><div class='actions'><input type='submit' value='Save Hostname'></div></div></form></section>");
    sendChunk("<section class='panel actionpanel'><h2>Footer bar</h2><div class='tablewrap'><table class='kv'>");
    sendInfoRow("Current mode", Esp32BaseWeb::footerBarModeName());
    sendChunk("</table></div><form method='post' action='/esp32base/system/footer-bar' onsubmit=\"return once(this)\"><div class='radioopts'>");
    sendFooterBarModeOption("off", "Off", Esp32BaseWeb::FOOTER_BAR_OFF);
    sendFooterBarModeOption("status", "Status only", Esp32BaseWeb::FOOTER_BAR_STATUS_ONLY);
    sendFooterBarModeOption("full", "Links + status", Esp32BaseWeb::FOOTER_BAR_FULL);
    sendChunk("</div><p class='muted'>Controls the compact bottom bar on built-in and app pages.</p><div class='actions'><input type='submit' value='Save Footer Bar'></div></form></section>");
#if ESP32BASE_ENABLE_FILELOG
    sendChunk("<section class='panel actionpanel'><h2>System logs</h2><div class='tablewrap'><table class='kv'>");
    sendInfoRow("Current mode", Esp32BaseFileLog::modeName());
    sendFileLogRuntimeStateRow("Runtime state");
    sendInfoRow("Path", Esp32BaseFileLog::path());
    sendChunk("</table></div>");
    sendFileLogRuntimeNotice();
    sendChunk("<form method='post' action='/esp32base/system/filelog' onsubmit=\"return once(this)\"><div class='radioopts'>");
    sendFileLogModeOption("off", "Off", Esp32BaseFileLog::OFF);
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_ERROR
    sendFileLogModeOption("error", "ERROR", Esp32BaseFileLog::ERROR);
#endif
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_WARN
    sendFileLogModeOption("warn", "WARN", Esp32BaseFileLog::WARN);
#endif
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_INFO
    sendFileLogModeOption("info", "INFO", Esp32BaseFileLog::INFO);
#endif
    sendChunk("</div><p class='muted'>System log mode is capped by the build log level.</p><div class='actions'><input type='submit' value='Save System Logs'></div></form></section>");
#else
    sendChunk("<section class='panel actionpanel'><h2>System logs</h2><p class='muted'>System diagnostic logs are unavailable in this profile.</p></section>");
#endif
#if ESP32BASE_ENABLE_WATCHDOG
    sendWatchdogPanel();
#endif
    sendChunk("</div><div class='toolgrid'>");
    sendChunk("<section class='panel dangerpanel'><h2>Restart device</h2><p class='muted'>Restart the device through the normal lifecycle path.</p><form method='post' action='/esp32base/system/reboot' onsubmit=\"return confirm('Reboot device now?')&&once(this)\"><div class='actions'><input class='danger' type='submit' value='Restart device'></div></form></section>");
#if ESP32BASE_ENABLE_FILELOG
    sendChunk("<section class='panel dangerpanel'><h2>Clear system logs</h2><p class='dangertext'>Delete all system diagnostic log contents. Runtime settings and WiFi credentials are not changed.</p><form method='post' action='/esp32base/system/logs-clear' onsubmit=\"return confirm('Clear system logs?')&&once(this)\"><div class='actions'><input class='danger' type='submit' value='Clear System Logs'></div></form></section>");
#else
    sendChunk("<section class='panel actionpanel'><h2>Clear system logs</h2><p class='muted'>System diagnostic logs are unavailable in this profile.</p></section>");
#endif
#if ESP32BASE_ENABLE_RECORD_STORE
    sendBusinessRecordStoresClearPanel();
#endif
#if ESP32BASE_ENABLE_APP_EVENTS
#if ESP32BASE_ENABLE_APP_EVENT_CONDITIONS
    sendChunk("<section class='panel dangerpanel'><h2>Clear App Event History</h2><p class='dangertext'>Delete retained App Event records. Confirmed condition states, system diagnostic logs, runtime settings and WiFi credentials are not changed.</p><form method='post' action='/esp32base/system/app-events-clear' onsubmit=\"return confirm('Clear App Event history?')&&once(this)\"><div class='actions'><input class='danger' type='submit' value='Clear App Event History'></div></form></section>");
#else
    sendChunk("<section class='panel dangerpanel'><h2>Clear App Event History</h2><p class='dangertext'>Delete retained App Event records. System diagnostic logs, runtime settings and WiFi credentials are not changed.</p><form method='post' action='/esp32base/system/app-events-clear' onsubmit=\"return confirm('Clear App Event history?')&&once(this)\"><div class='actions'><input class='danger' type='submit' value='Clear App Event History'></div></form></section>");
#endif
#endif
#if ESP32BASE_ENABLE_FS
    sendChunk("<section class='panel dangerpanel'><h2>Format LittleFS</h2><p class='dangertext'>This deletes logs and all files stored in LittleFS. WiFi, Web Auth and NVS config are not cleared.</p><form method='post' action='/esp32base/system/format-fs' onsubmit=\"return confirm('Format LittleFS? This deletes logs and all files stored in LittleFS.')&&once(this)\"><div class='actions'><input class='danger' type='submit' value='Format LittleFS'></div></form></section>");
#else
    sendChunk("<section class='panel actionpanel'><h2>Format LittleFS</h2><p class='muted'>LittleFS is unavailable in this profile.</p></section>");
#endif
    sendChunk("</div>");
    Esp32BaseWeb::sendFooter();
}

void handleToolsFileLogPost() {
    markRequest();
    if (!ensurePostAllowed("tools_filelog")) {
        return;
    }
#if ESP32BASE_ENABLE_FILELOG
    Esp32BaseFileLog::Mode mode = Esp32BaseFileLog::OFF;
    if (!fileLogModeFromArg(g_server.arg("mode"), mode)) {
        ESP32BASE_LOG_W("web", "filelog_mode_rejected source=tools value=%s", g_server.arg("mode").c_str());
        redirectSeeOther("/esp32base/system?error=filelog_invalid_mode");
        return;
    }
    ESP32BASE_LOG_W("web", "filelog_mode_requested source=tools from=%s to=%s",
                    Esp32BaseFileLog::modeName(),
                    fileLogModeName(mode));
    const bool ok = Esp32BaseFileLog::setMode(mode);
    redirectSeeOther(ok ? "/esp32base/system?filelog_saved=1" : "/esp32base/system?error=filelog_save_failed");
#else
    redirectSeeOther("/esp32base/system?error=filelog_unavailable");
#endif
}

void handleToolsFooterBarPost() {
    markRequest();
    if (!ensurePostAllowed("tools_footer_bar")) {
        return;
    }
    Esp32BaseWeb::FooterBarMode mode = Esp32BaseWeb::FOOTER_BAR_FULL;
    if (!footerBarModeFromArg(g_server.arg("mode"), mode)) {
        ESP32BASE_LOG_W("web", "footer_bar_mode_rejected source=tools value=%s", g_server.arg("mode").c_str());
        redirectSeeOther("/esp32base/system?error=footer_bar_invalid_mode");
        return;
    }
    ESP32BASE_LOG_W("web", "footer_bar_mode_requested source=tools from=%s to=%s",
                    Esp32BaseWeb::footerBarModeName(),
                    footerBarModeName(mode));
    const bool ok = Esp32BaseWeb::setFooterBarMode(mode);
    redirectSeeOther(ok ? "/esp32base/system?footer_saved=1" : "/esp32base/system?error=footer_bar_save_failed");
}

