tangyangguang/Esp32Base/src/web/internal/WebTools.cpp
void handleToolsRebootPost() {
    markRequest();
    if (!ensurePostAllowed("tools_reboot")) {
        return;
    }
    ESP32BASE_LOG_W("web", "restart_requested source=tools");
    Esp32BaseWeb::sendHeader("Rebooting");
    sendChunk("<script>history.replaceState(null,'','/esp32base/system?restarting=1');</script>");
    Esp32BaseWeb::sendPageTitle("Rebooting", "Device restart was accepted.");
    sendChunk("<section class='panel actionpanel'><h2>Restart requested</h2><p class='muted'>Device is restarting. Please wait a few seconds, then reload the System page.</p><div class='actions'><a class='btnlink' href='/esp32base/system'>Reload System</a></div></section>");
    Esp32BaseWeb::sendFooter();
    delay(100);
    Esp32BaseSystem::restart("web");
}

#if ESP32BASE_ENABLE_WATCHDOG
void handleToolsWatchdogTripResetPost() {
    markRequest();
    if (!ensurePostAllowed("tools_watchdog_trip_reset")) {
        return;
    }
    const uint32_t lifetime = Esp32BaseWatchdog::lifetimeResetCount();
    const uint32_t resetTime = currentWatchdogTripResetTime();
    const bool writeOk = Esp32BaseConfig::setInt("eb_sys", "wdt_trip_base", static_cast<int32_t>(lifetime)) &&
                         Esp32BaseConfig::setInt("eb_sys", "wdt_trip_time", static_cast<int32_t>(resetTime));
    const bool verifyOk = Esp32BaseConfig::getInt("eb_sys", "wdt_trip_base", -1) == static_cast<int32_t>(lifetime) &&
                          Esp32BaseConfig::getInt("eb_sys", "wdt_trip_time", -1) == static_cast<int32_t>(resetTime);
    const bool ok = writeOk && verifyOk;
    ESP32BASE_LOG_W("web", "watchdog_trip_reset_requested source=tools lifetime=%lu time=%lu result=%s",
                    static_cast<unsigned long>(lifetime),
                    static_cast<unsigned long>(resetTime),
                    ok ? "success" : "failed");
    redirectSeeOther(ok ? "/esp32base/system?watchdog_trip_reset=1" : "/esp32base/system?error=watchdog_trip_reset_failed");
}
#endif

void handleToolsFormatFsPost() {
    markRequest();
    if (!ensurePostAllowed("tools_format_fs")) {
        return;
    }
#if ESP32BASE_ENABLE_FS
    ESP32BASE_LOG_W("web", "fs_format_requested source=tools");
#if ESP32BASE_ENABLE_FILELOG
    Esp32BaseFileLog::flush();
#endif
    const bool formatted = Esp32BaseFs::format();
    const bool mounted = formatted && Esp32BaseFs::begin();
    bool fileLogReloaded = false;
    bool appEventsRecreated = false;
    uint8_t businessStoreCount = 0;
    uint8_t businessStoresReloaded = 0;
#if ESP32BASE_ENABLE_FILELOG
    if (mounted) {
        fileLogReloaded = Esp32BaseFileLog::begin();
    }
#endif
#if ESP32BASE_ENABLE_APP_EVENTS
    if (mounted) {
        appEventsRecreated = Esp32BaseAppEvents::reload();
    }
#endif
#if ESP32BASE_ENABLE_RECORD_STORE
    businessStoreCount = businessRecordStoreCount();
    if (mounted) {
        for (uint8_t i = 0; i < businessStoreCount; ++i) {
            Esp32BaseRecordStore* store = businessRecordStoreAt(i);
            Esp32BaseRecordStore::StoreStatus status;
            if (store && store->reload() && store->readStatus(status) && status.ready) {
                ++businessStoresReloaded;
            } else {
                ESP32BASE_LOG_W("web", "business_record_store_reload_failed source=tools_format path=%s state=%s error=%s",
                                store && store->path() ? store->path() : "-",
                                store ? Esp32BaseRecordStore::storeStateName(store->state()) : "missing",
                                store && store->lastErrorReason() ? store->lastErrorReason() : "unavailable");
            }
        }
    }
#endif
    ESP32BASE_LOG_W("web", "fs_format_completed source=tools format=%s mount=%s filelog_reload=%s app_events_recreate=%s business_stores_reload=%u/%u",
                    formatted ? "success" : "failed",
                    mounted ? "success" : "failed",
                    fileLogReloaded ? "success" : "skipped",
                    appEventsRecreated ? "success" : "skipped",
                    static_cast<unsigned>(businessStoresReloaded),
                    static_cast<unsigned>(businessStoreCount));
    if (formatted) {
        notifyToolsFormatFsSuccess(mounted, fileLogReloaded, businessStoreCount, businessStoresReloaded);
    }
    if (formatted && mounted
#if ESP32BASE_ENABLE_APP_EVENTS
        && appEventsRecreated
#endif
        && businessStoresReloaded == businessStoreCount
    ) {
        redirectSeeOther("/esp32base/system?formatted=1");
    } else {
        redirectSeeOther(!formatted ? "/esp32base/system?error=format_failed" :
                         !mounted ? "/esp32base/system?error=mount_failed" :
#if ESP32BASE_ENABLE_APP_EVENTS
                         !appEventsRecreated ? "/esp32base/system?error=app_events_recreate_failed" :
#endif
                         "/esp32base/system?error=business_record_stores_recreate_failed");
    }
#else
    ESP32BASE_LOG_W("web", "fs_format_requested source=tools result=unavailable");
    redirectSeeOther("/esp32base/system?error=fs_unavailable");
#endif
}

void handleToolsLogsClearPost() {
    markRequest();
    if (!ensurePostAllowed("tools_logs_clear")) {
        return;
    }
#if ESP32BASE_ENABLE_FILELOG
    const bool ok = Esp32BaseFileLog::clear();
    redirectSeeOther(ok ? "/esp32base/system?logs_cleared=1" : "/esp32base/system?error=logs_clear_failed");
#else
    redirectSeeOther("/esp32base/system?error=logs_unavailable");
#endif
}

#if ESP32BASE_ENABLE_RECORD_STORE
void handleToolsBusinessRecordsClearPost() {
    markRequest();
    if (!ensurePostAllowed("tools_business_records_clear")) {
        return;
    }
    const uint8_t total = businessRecordStoreCount();
    if (total == 0) {
        ESP32BASE_LOG_W("web", "business_records_clear_rejected reason=no_registered_stores");
        redirectSeeOther("/esp32base/system?business_records_not_ready=1");
        return;
    }
    for (uint8_t i = 0; i < total; ++i) {
        Esp32BaseRecordStore* store = businessRecordStoreAt(i);
        Esp32BaseRecordStore::StoreStatus status;
        if (!store || !store->readStatus(status) || !status.ready) {
            ESP32BASE_LOG_W("web", "business_records_clear_rejected reason=store_not_ready path=%s state=%s",
                            store && store->path() ? store->path() : "-",
                            store ? Esp32BaseRecordStore::storeStateName(store->state()) : "missing");
            redirectSeeOther("/esp32base/system?business_records_not_ready=1");
            return;
        }
    }

    ESP32BASE_LOG_W("web", "business_records_clear_requested source=tools stores=%u",
                    static_cast<unsigned>(total));
    uint8_t cleared = 0;
    uint8_t cleanupWarnings = 0;
    for (uint8_t i = 0; i < total; ++i) {
        Esp32BaseRecordStore* store = businessRecordStoreAt(i);
        const char* path = store && store->path() ? store->path() : "-";
        Esp32BaseRecordStore::StoreStatus beforeStatus;
        Esp32BaseRecordStore::StoreStatus status;
        const bool beforeReadable = store && store->readStatus(beforeStatus);
        const bool clearReturned = beforeReadable && store->clear();
        const bool statusReadable = store && store->readStatus(status);
        const bool logicallyEmpty = clearReturned && statusReadable && status.ready &&
                                    status.recordCount == 0 &&
                                    status.nextRecordId == beforeStatus.nextRecordId;
        if (!logicallyEmpty) {
            ESP32BASE_LOG_W("web", "business_record_store_clear_failed path=%s clear=%s status=%s records=%lu error=%s",
                            path,
                            clearReturned ? "success" : "failed",
                            statusReadable ? Esp32BaseRecordStore::storeStateName(status.state) : "unavailable",
                            static_cast<unsigned long>(statusReadable ? status.recordCount : 0),
                            statusReadable && status.errorReason ? status.errorReason : "status_unavailable");
            break;
        }
        ++cleared;
        if (status.state != Esp32BaseRecordStore::StoreState::Ready) {
            ++cleanupWarnings;
        }
        ESP32BASE_LOG_W("web", "business_record_store_cleared path=%s state=%s next_id=%lu",
                        path,
                        Esp32BaseRecordStore::storeStateName(status.state),
                        static_cast<unsigned long>(status.nextRecordId));
    }

    char location[128];
    if (cleared == total) {
        snprintf(location, sizeof(location),
                 "/esp32base/system?business_records_cleared=%u%s",
                 static_cast<unsigned>(cleared),
                 cleanupWarnings ? "&cleanup_warning=1" : "");
    } else {
        snprintf(location, sizeof(location),
                 "/esp32base/system?business_records_clear_failed=1&cleared=%u&total=%u",
                 static_cast<unsigned>(cleared),
                 static_cast<unsigned>(total));
    }
    ESP32BASE_LOG_W("web", "business_records_clear_completed source=tools cleared=%u total=%u warnings=%u",
                    static_cast<unsigned>(cleared),
                    static_cast<unsigned>(total),
                    static_cast<unsigned>(cleanupWarnings));
    redirectSeeOther(location);
}
#endif

#if ESP32BASE_ENABLE_APP_EVENTS
void handleToolsAppEventsClearPost() {
    markRequest();
    if (!ensurePostAllowed("tools_app_events_clear")) {
        return;
    }
    const bool ok = Esp32BaseAppEvents::clearEventHistory();
    redirectSeeOther(ok ? "/esp32base/system?app_events_cleared=1" : "/esp32base/system?error=app_events_clear_failed");
}
#endif

} // namespace esp32base_web

#endif
